app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_name]
      @songs = Artist.find(params[:artist_name]).songs
      redirect_to artist_song_path(@artist, @song)
    else
    @songs = Song.all